old_perSite/app/controllers/paintings_controller.rb

INSERT INTO "paintings" ("artist_name", "description", "aquisition_date", "image", "title", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @painting = Painting.new(painting_params)
    @painting.owner = current_user
    if @painting.save

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @painting = Painting.find_by_id(params[:id])

SELECT "paintings".* FROM "paintings"
---
  def index
    @paintings = Painting.all