old_perSite/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "short"], ["body", "long"], ["author_id", 2], ["created_at", "2015-12-30 05:50:00.696576"], ["updated_at", "2015-12-30 05:50:00.696576"]]
---
	def create
		@post = Post.new(post_params)
		@post.author = current_user
		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
---
	def show
		@post = Post.includes(:author).find_by_id(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@post = Post.find_by_id(params[:id])